DataProcessors/ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЭтапыЭкспретизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭтапыЭкспретизы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Одобрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленВФилиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийИсправленияПоступленияРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИсправленияПоступленияРеализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СогласованноеИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПередачиТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ) Реализация со склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСогласованияРеклВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСогласованияРеклВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЭкспертиза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат/Ext/ObjectModule.bsl
Процедура РегламентноеВыполнение() Экспорт 
	
	ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат();	

КонецПроцедуры

Процедура ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат() Экспорт 
	
	ЗапросДокументовЗаявкаНаВозврат = Новый Запрос;
	ЗапросДокументовЗаявкаНаВозврат.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка КАК ЗаявкаНаВозврат,
	|	Константы.ОсновнойПоставщик
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары,
	|	Константы КАК Константы
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка.Проведен
	|	И ЗаявкаНаВозвратТовары.Тип = ""Рекламация""
	|	И ЗаявкаНаВозвратТовары.Ссылка.Статус = ""На экспертизе""
	|	И ЗаявкаНаВозвратТовары.Ссылка.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.Одобрен)
	|	И ЗаявкаНаВозвратТовары.Ссылка.Поставщик = Константы.ОсновнойПоставщик";
	
	РезультатЗапросаЗаявокНаВозврат = ЗапросДокументовЗаявкаНаВозврат.Выполнить();
	
	Если НЕ РезультатЗапросаЗаявокНаВозврат.Пустой() Тогда
		
		ЗапросАдресов = Новый Запрос;
		ЗапросАдресов.Текст =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Представление КАК АдресЭлПочты
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРабочийФизическогоЛица)
		|				И КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
		|				И КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьУведомлениеОбУспешномЗавершенииЭкспертизы))";
		
		ТаблицаАдресов = ЗапросАдресов.Выполнить().Выгрузить();
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить(); 		
		
		Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) ИЛИ ТаблицаАдресов.Количество() = 0 Тогда
			ОтправляемПочту = Ложь;
		Иначе 
			
			ОтправляемПочту = Истина;
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			Почта = Новый ИнтернетПочта; 	
			
		КонецЕсли;
		
		ВыборкаЗаявокНаВозврат = РезультатЗапросаЗаявокНаВозврат.Выбрать();
		
		Пока ВыборкаЗаявокНаВозврат.Следующий() Цикл
			
			//+Сёмин Р. 17.12.2025 #UT10-5590
			Если НЕ ВЗаявкеСтатусФНСКонтрагентаКорректный(ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат) Тогда
				
				ЗаписьЖурналаРегистрации(
					"Ввод возврата и корректировки на экспертизные заявки на возврат",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Документы.ЗаявкаНаВозврат,
					ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат,
					"Некорректный статус ФНС контрагента"
				);
				
				Продолжить;
			КонецЕсли;
			//-Сёмин Р. 17.12.2025 #UT10-5590
			
			НачатьТранзакцию();
			
			ПромДокументЗаявка = ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат;
			
			ЕстьКорректировкаРеализации = Документы.КорректировкаРеализации.НайтиПоРеквизиту("ЗаявкаНаВозврат",ПромДокументЗаявка);
			
			Если ЕстьКорректировкаРеализации.Пустая() Тогда
				
				НоваяКорректировкаРеализации = Документы.КорректировкаРеализации.СоздатьДокумент();
				НоваяКорректировкаРеализации.Дата = ТекущаяДата();
				НоваяКорректировкаРеализации.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НоваяКорректировкаРеализации.Заполнить(ПромДокументЗаявка);
				НоваяКорректировкаРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
				
				Для Каждого СтрДок Из НоваяКорректировкаРеализации.Товары Цикл
					
					СтрДок.Количество = СтрДок.КоличествоДоИзменения;
					СтрДок.ОтражатьТоварныйУчет = Ложь;
					СтрДок.Сумма = СтрДок.Цена * СтрДок.Количество;
					СтрДок.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрДок.Сумма, НоваяКорректировкаРеализации.УчитыватьНДС, НоваяКорректировкаРеализации.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрДок.СтавкаНДС));
					
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЗаявкаНаВозвратТовары.Номенклатура,
				|	ЗаявкаНаВозвратТовары.Ссылка КАК ЗаявкаНаВозврат
				|ИЗ
				|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
				|ГДЕ
				|	ЗаявкаНаВозвратТовары.Ссылка = &ЗаявкаНаВозврат";  
				
				Запрос.УстановитьПараметр("ЗаявкаНаВозврат", ПромДокументЗаявка);
				
				НоваяКорректировкаРеализации.ЗаявкиНаВозврат.Загрузить(Запрос.Выполнить().Выгрузить());
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗаявкаНаВозвратТовары.Номенклатура,
				|	МАКСИМУМ(ЗаявкаНаВозвратТовары.Ссылка) КАК ЗаявкаНаВозврат,
				|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК КоличествоФакт
				|ИЗ
				|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
				|ГДЕ
				|	ЗаявкаНаВозвратТовары.Ссылка = &ЗаявкаНаВозврат
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаявкаНаВозвратТовары.Номенклатура";
				
				Запрос.УстановитьПараметр("ЗаявкаНаВозврат", ПромДокументЗаявка);
				
				Товары2 = Запрос.Выполнить().Выгрузить();
				
				Для Каждого Стр Из Товары2 Цикл
					
					КоличествоКРаспределению = Стр.КоличествоФакт;
					
					Если КоличествоКРаспределению Тогда
						
						Отбор = Новый Структура;
						Отбор.Вставить("Номенклатура", Стр.Номенклатура);
						
						Массив = НоваяКорректировкаРеализации.Товары.НайтиСтроки(Отбор);
						
						Для Каждого СтрДок Из Массив Цикл
							
							Если КоличествоКРаспределению Тогда
								
								Если СтрДок.КоличествоДоИзменения >= КоличествоКРаспределению Тогда
									
									СтрДок.Количество = СтрДок.КоличествоДоИзменения - КоличествоКРаспределению;
									КоличествоКРаспределению = 0;
									
								Иначе
									
									СтрДок.Количество = 0;
									КоличествоКРаспределению = КоличествоКРаспределению - СтрДок.КоличествоДоИзменения;
									
								КонецЕсли;
								
								СтрДок.ОтражатьТоварныйУчет = Истина;
								СтрДок.Сумма = СтрДок.Цена * СтрДок.Количество;
								СтрДок.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрДок.Сумма, НоваяКорректировкаРеализации.УчитыватьНДС, НоваяКорректировкаРеализации.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрДок.СтавкаНДС));
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Попытка
					НоваяКорректировкаРеализации.ПровестиИСоздатьКорректировкиЗаказа();					
				Исключение
					
					ЗаписьЖурналаРегистрации("Ввод возврата и корректировки на экспертизные заявки на возврат", УровеньЖурналаРегистрации.Ошибка, , ,
					"Не удалось провести документ "+СокрЛП(НоваяКорректировкаРеализации)+" по "+СокрЛП(ПромДокументЗаявка)+" "+ОписаниеОшибки());
					ОтменитьТранзакцию(); 					
					Продолжить;                                           
					
				КонецПопытки;
				
			КонецЕсли;
			
			ЕстьДокументВозвратПоставщику = Документы.ВозвратТоваровПоставщику.НайтиПоРеквизиту("ДокументОснование",ПромДокументЗаявка);
			
			Если ЕстьДокументВозвратПоставщику.Пустая() 
				ИЛИ НЕ ЕстьДокументВозвратПоставщику.Проведен Тогда
				
				НовыйДокВозвратПоставщику = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
				НовыйДокВозвратПоставщику.Дата = ТекущаяДата();
				НовыйДокВозвратПоставщику.Ответственный = ПараметрыСеанса.ТекущийПользователь; 
				НовыйДокВозвратПоставщику.Заполнить(ПромДокументЗаявка);				
				НовыйДокВозвратПоставщику.ВозвратРекламационногоТовара = Ложь; 
				НовыйДокВозвратПоставщику.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
				НовыйДокВозвратПоставщику.СтатусСогласования = Перечисления.СтатусыСогласованияРеклВозвратов.Согласовано; 
				
				Если НЕ НовыйДокВозвратПоставщику.Товары.Количество() = 0 Тогда
					
					НовыйДокВозвратПоставщику.Записать(РежимЗаписиДокумента.Запись);
					
					Попытка
						НовыйДокВозвратПоставщику.Записать(РежимЗаписиДокумента.Проведение);					
					Исключение
						
						ЗаписьЖурналаРегистрации("Ввод возврата и корректировки на экспертизные заявки на возврат", УровеньЖурналаРегистрации.Ошибка, , ,
						"Не удалось провести документ "+СокрЛП(НовыйДокВозвратПоставщику)+" по "+СокрЛП(ПромДокументЗаявка)+" "+ОписаниеОшибки());
						ОтменитьТранзакцию(); 
						Продолжить;
						
					КонецПопытки;
					
				Иначе 
					
					ОтменитьТранзакцию();
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;

			ЗафиксироватьТранзакцию();        
			
			Если Не ТаблицаАдресов.Количество() = 0 И ОтправляемПочту Тогда
				
				Попытка 
					
					Почта.Подключиться(Профиль); 
					
					НомерДокументаКорректировки = ?(НЕ ЕстьКорректировкаРеализации.Пустая(), ЕстьКорректировкаРеализации.Номер, НоваяКорректировкаРеализации.Номер);
					НомерДокументаВозврат       = ?(НЕ ЕстьДокументВозвратПоставщику.Пустая(), ЕстьДокументВозвратПоставщику.Номер, НовыйДокВозвратПоставщику.Номер);
					
					Текстсообщения = " Экспертиза по заявке на возврат " + СокрЛП(ПромДокументЗаявка.Номер) + " завершена успешно."+
					Символы.ПС + " Для клиента " + СокрЛП(ПромДокументЗаявка.Реализация.Грузополучатель)+
					Символы.ПС + " автоматически созданы корректировка реализации " + СокрЛП(НомерДокументаКорректировки) +
					Символы.ПС + " и возврат товаров поставщику " + СокрЛП(НомерДокументаВозврат) + "";
					
					Для Каждого ВыборкаВдресов Из ТаблицаАдресов Цикл   
						
						МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ВыборкаВдресов.АдресЭлПочты, ";"); 
						
						Для Каждого ТекАдрес Из МассивАдресов Цикл
							
							ПромАдресОтправки = СокрЛП(ТекАдрес);			
							Сообщение = Новый ИнтернетПочтовоеСообщение;
							Сообщение.Тема = "Уведомление об успешном завершении экспертизы товаров";
							Сообщение.Получатели.Добавить(ПромАдресОтправки); 
							Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
							Сообщение.Тексты.Добавить(ТекстСообщения);
							Почта.Послать(Сообщение);
							
						КонецЦикла;  
						
					КонецЦикла;
					
					Почта.Отключиться();
					
				Исключение 
					
					ЗаписьЖурналаРегистрации("Отправка оповещения о завершении экспертизы товаров", УровеньЖурналаРегистрации.Предупреждение,,, 
					"Ошибка при подключении к почтовому серверу. " + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВЗаявкеСтатусФНСКонтрагентаКорректный(Заявка)
	
	//+Сёмин Р. 17.12.2025 #UT10-5590
	мРеализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "Реализация");
	мКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мРеализация, "Контрагент");
	мОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мРеализация, "Организация");
	мДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мРеализация, "ДоговорКонтрагента");
	
	Возврат Справочники.Контрагенты.СтатусФНСКонтрагентаКорректный(мКонтрагент, мОрганизация, мДоговорКонтрагента);
	//-Сёмин Р. 17.12.2025 #UT10-5590
	
КонецФункции
